[Demo_Destiny_ep6_2 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=2136,Y=-2383,Z=0),VecSub=(X=90,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[13]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0103_lp_close_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0107_fx_Stand2Perplex",Rate=0,Number=3,Bit=1)
DemoScripts[14]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0700_lp_Perplex",Number=8)
DemoScripts[15]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep6_2.GG2_V_DES_ep6_2_003_Cue',Name="エコロ")
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[17]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0701_fx_Perplex2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[20]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[21]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[23]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[24]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[25]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Destiny_ep6_2.GG2_V_DES_ep6_2_008_Cue',Name="エコロ")
DemoScripts[26]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[27]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[28]=(Actor=WINDOW,Command=EXIT)
DemoScripts[29]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[30]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[31]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[32]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[33]=(Actor=SYSTEM,Command=END)

[Select_Destiny_ep6_2 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Destiny_ep6_2 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="............")

Texts[1]=(Label="TEXT02",Name="峯大",Text="如何,艾可蘿?/n差不多該出現有那種感覺的人了吧......")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="不......我沒找到./n搞不好這所學校裡沒有也說不定......")

Texts[3]=(Label="TEXT04",Name="峯大",Text="這樣啊......沒有啊....../n我命運的對象......")

Texts[4]=(Label="TEXT05",Name="峯大",Text="............")

Texts[5]=(Label="TEXT06",Name="峯大",Text="(無論拒絕幾次告白,或是讓她昇天,/n都還是來向我挑戰的\"那個人\"的樣貌....../n還有聲音......都在我腦海裡揮之不去......)")

Texts[6]=(Label="TEXT07",Name="峯大",Text="(我心中\"那個人\"的身影鮮明又深刻....../n但那卻......不是我的命運之人嗎......)")

Texts[7]=(Label="TEXT08",Name="艾可蘿",Text="峯大大人?/n你怎麼了嗎?")

Texts[8]=(Label="",Name="",Text="")

Texts[9]=(Label="SELECT01",Name="",Text="")

Texts[10]=(Label="SELECT02",Name="",Text="")

Texts[11]=(Label="SELECT03",Name="",Text="")

Texts[12]=(Label="SELECT04",Name="",Text="")

Texts[13]=(Label="SELECT05",Name="",Text="")

Texts[14]=(Label="SELECT06",Name="",Text="")

Texts[15]=(Label="SELECT07",Name="",Text="")

Texts[16]=(Label="SELECT08",Name="",Text="")

Texts[17]=(Label="SELECT09",Name="",Text="")

Texts[18]=(Label="SELECT10",Name="",Text="")


